package com.company;

/*
Организуем гонки:
Все участники должны стартовать одновременно, несмотря на то, что на подготовку у каждого из них уходит разное время.
В туннель не может заехать одновременно больше половины участников (условность).
Попробуйте всё это синхронизировать.
Только после того как все завершат гонку, нужно выдать объявление об окончании.
Можете корректировать классы (в т.ч. конструктор машин) и добавлять объекты классов из пакета util.concurrent.
*/
public class Main {

    public static void main(String[] args) {
        Race race = new Race(4, new Road(60,false), new Tunnel(false), new Road(40,true));
        race.start();
    }
}
